# Pandas Dataframe

## 1. Importar librerias

In [1]:
import numpy as np
import pandas as pd

In [2]:
np.__version__

'1.23.3'

In [3]:
pd.__version__

'1.5.1'

## 2. Creacion de Datos prueba

In [10]:
filas = ["ventas1","ventas2","ventas3"]
columnas = ["zona1","zona2","zona3"]

np.random.seed(1234)
datos = np.random.randint(100,200,size=(3,3))

In [13]:
filas

['ventas1', 'ventas2', 'ventas3']

In [12]:
columnas

['zona1', 'zona2', 'zona3']

In [11]:
datos

array([[147, 183, 138],
       [153, 176, 124],
       [115, 149, 123]])

## 3. Crear el Dataframe

In [14]:
dataframe = pd.DataFrame(data=datos, index=filas, columns=columnas, dtype=float)

In [15]:
dataframe

         zona1  zona2  zona3
ventas1  147.0  183.0  138.0
ventas2  153.0  176.0  124.0
ventas3  115.0  149.0  123.0

In [19]:
dataframe2 = pd.DataFrame(datos, columns= columnas, dtype=float)

In [20]:
dataframe2

   zona1  zona2  zona3
0  147.0  183.0  138.0
1  153.0  176.0  124.0
2  115.0  149.0  123.0

In [21]:
dataframe3 = pd.DataFrame(datos, index= filas, dtype=float)

In [22]:
dataframe3

             0      1      2
ventas1  147.0  183.0  138.0
ventas2  153.0  176.0  124.0
ventas3  115.0  149.0  123.0

## 4. Operaciones aritmeticas +, -, *, /, //, **

In [23]:
dataframe +1

         zona1  zona2  zona3
ventas1  148.0  184.0  139.0
ventas2  154.0  177.0  125.0
ventas3  116.0  150.0  124.0

In [24]:
dataframe

         zona1  zona2  zona3
ventas1  147.0  183.0  138.0
ventas2  153.0  176.0  124.0
ventas3  115.0  149.0  123.0

In [25]:
dataframe.add(2)

         zona1  zona2  zona3
ventas1  149.0  185.0  140.0
ventas2  155.0  178.0  126.0
ventas3  117.0  151.0  125.0

In [26]:
dataframe

         zona1  zona2  zona3
ventas1  147.0  183.0  138.0
ventas2  153.0  176.0  124.0
ventas3  115.0  149.0  123.0

In [27]:
help(dataframe.add)

Help on method add in module pandas.core.ops:

add(other, axis='columns', level=None, fill_value=None) method of pandas.core.frame.DataFrame instance
    Get Addition of dataframe and other, element-wise (binary operator `add`).

    Equivalent to ``dataframe + other``, but with support to substitute a fill_value
    for missing data in one of the inputs. With reverse version, `radd`.

    Among flexible wrappers (`add`, `sub`, `mul`, `div`, `mod`, `pow`) to
    arithmetic operators: `+`, `-`, `*`, `/`, `//`, `%`, `**`.

    Parameters
    ----------
    other : scalar, sequence, Series, dict or DataFrame
        Any single or multiple element data structure, or list-like object.
    axis : {0 or 'index', 1 or 'columns'}
        Whether to compare by the index (0 or 'index') or columns.
        (1 or 'columns'). For Series input, axis to match Series index on.
    level : int or label
        Broadcast across a level, matching Index values on the
        passed MultiIndex level.
    fill_value : float or None, default None
        Fill existing missing (NaN) values, and any new element needed for
        successful DataFrame alignment, with this value before computation.
        If data in both corresponding DataFrame locations is missing
        the result will be missing.

    Returns
    -------
    DataFrame
        Result of the arithmetic operation.

    See Also
    --------
    DataFrame.add : Add DataFrames.
    DataFrame.sub : Subtract DataFrames.
    DataFrame.mul : Multiply DataFrames.
    DataFrame.div : Divide DataFrames (float division).
    DataFrame.truediv : Divide DataFrames (float division).
    DataFrame.floordiv : Divide DataFrames (integer division).
    DataFrame.mod : Calculate modulo (remainder after division).
    DataFrame.pow : Calculate exponential power.

    Notes
    -----
    Mismatched indices will be unioned together.

    Examples
    --------
    >>> df = pd.DataFrame({'angles': [0, 3, 4],
    ...                    'degrees': [360, 180, 360]},
    ...                   index=['circle', 'triangle', 'rectangle'])
    >>> df
               angles  degrees
    circle          0      360
    triangle        3      180
    rectangle       4      360

    Add a scalar with operator version which return the same
    results.

    >>> df + 1
               angles  degrees
    circle          1      361
    triangle        4      181
    rectangle       5      361

    >>> df.add(1)
               angles  degrees
    circle          1      361
    triangle        4      181
    rectangle       5      361

    Divide by constant with reverse version.

    >>> df.div(10)
               angles  degrees
    circle        0.0     36.0
    triangle      0.3     18.0
    rectangle     0.4     36.0

    >>> df.rdiv(10)
                 angles   degrees
    circle          inf  0.027778
    triangle   3.333333  0.055556
    rectangle  2.500000  0.027778

    Subtract a list and Series by axis with operator version.

    >>> df - [1, 2]
               angles  degrees
    circle         -1      358
    triangle        2      178
    rectangle       3      358

    >>> df.sub([1, 2], axis='columns')
               angles  degrees
    circle         -1      358
    triangle        2      178
    rectangle       3      358

    >>> df.sub(pd.Series([1, 1, 1], index=['circle', 'triangle', 'rectangle']),
    ...        axis='index')
               angles  degrees
    circle         -1      359
    triangle        2      179
    rectangle       3      359

    Multiply a dictionary by axis.

    >>> df.mul({'angles': 0, 'degrees': 2})
                angles      degrees
    circle           0          720
    triangle             0      360
    rectangle            0      720

    >>> df.mul({'circle': 0, 'triangle': 2, 'rectangle': 3}, axis='index')
                angles      degrees
    circle               0        0
    triangle             6      360
    rectangle           12     1080

    Multiply a DataFrame of different shape with operator version.

    >>> other = pd.DataFrame({'angles': [0, 3, 4]},
    ...                      index=['circle', 'triangle', 'rectangle'])
    >>> other
               angles
    circle          0
    triangle        3
    rectangle       4

    >>> df * other
               angles  degrees
    circle          0      NaN
    triangle        9      NaN
    rectangle      16      NaN

    >>> df.mul(other, fill_value=0)
               angles  degrees
    circle          0      0.0
    triangle        9      0.0
    rectangle      16      0.0

    Divide by a MultiIndex by level.

    >>> df_multindex = pd.DataFrame({'angles': [0, 3, 4, 4, 5, 6],
    ...                              'degrees': [360, 180, 360, 360, 540, 720]},
    ...                             index=[['A', 'A', 'A', 'B', 'B', 'B'],
    ...                                    ['circle', 'triangle', 'rectangle',
    ...                                     'square', 'pentagon', 'hexagon']])
    >>> df_multindex
                 angles  degrees
    A circle          0      360
      triangle        3      180
      rectangle       4      360
    B square          4      360
      pentagon        5      540
      hexagon         6      720

    >>> df.div(df_multindex, level=1, fill_value=0)
                 angles  degrees
    A circle        NaN      1.0
      triangle      1.0      1.0
      rectangle     1.0      1.0
    B square        0.0      0.0
      pentagon      0.0      0.0
      hexagon       0.0      0.0

In [29]:
dataframe

         zona1  zona2  zona3
ventas1  147.0  183.0  138.0
ventas2  153.0  176.0  124.0
ventas3  115.0  149.0  123.0

In [30]:
dataframe + [33,7,2]

         zona1  zona2  zona3
ventas1  180.0  190.0  140.0
ventas2  186.0  183.0  126.0
ventas3  148.0  156.0  125.0

In [31]:
dataframe * [.2, .3, .5]

         zona1  zona2  zona3
ventas1   29.4   54.9   69.0
ventas2   30.6   52.8   62.0
ventas3   23.0   44.7   61.5

## 5. Acceder a los elementos

In [32]:
dataframe.loc['ventas1']

zona1    147.0
zona2    183.0
zona3    138.0
Name: ventas1, dtype: float64

In [34]:
dataframe.loc[['ventas1','ventas3']]

         zona1  zona2  zona3
ventas1  147.0  183.0  138.0
ventas3  115.0  149.0  123.0

In [35]:
dataframe.loc['zona1']

KeyError: 'zona1'

In [36]:
dataframe['zona1']

ventas1    147.0
ventas2    153.0
ventas3    115.0
Name: zona1, dtype: float64

In [37]:
dataframe[['zona1','zona3']]

         zona1  zona3
ventas1  147.0  138.0
ventas2  153.0  124.0
ventas3  115.0  123.0

In [39]:
dataframe['zona1'] < 150

ventas1     True
ventas2    False
ventas3     True
Name: zona1, dtype: bool

In [40]:
dataframe.loc[(dataframe['zona1'] < 150)]

         zona1  zona2  zona3
ventas1  147.0  183.0  138.0
ventas3  115.0  149.0  123.0

In [41]:
dataframe

         zona1  zona2  zona3
ventas1  147.0  183.0  138.0
ventas2  153.0  176.0  124.0
ventas3  115.0  149.0  123.0